pokedex_api/app/controllers/pokemon_controller.rb

  def index #my pokemon page
    render json: Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def create #adding a pokemon to the list = new item in db
    # binding.pry
# {"pokemonId"=>"1", "pokemonName"=>"bulbasaur",
#   "controller"=>"pokemon", "action"=>"create",
#   "pokemon"=>{}} permitted: false>
    pokemon = Pokemon.find_or_create_by(pokemon_url_id: params[:pokemonId],
                              pokemon_name: params[:pokemonName])
---
INSERT INTO "pokemons" ("pokemon_url_id", "pokemon_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pokemon_url_id", 2], ["pokemon_name", "ivysaur"], ["created_at", "2018-08-04 17:56:25.970647"], ["updated_at", "2018-08-04 17:56:25.970647"]]
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."pokemon_url_id" = ? AND "pokemons"."pokemon_name" = ? LIMIT ?  [["pokemon_url_id", 1], ["pokemon_name", "bulbasaur"], ["LIMIT", 1]]